[net]
subdivisions=1
batch=1

height=4
width=1
channels=1

max_batches=3000
time_steps=1

learning_rate=0.003

policy=constant

[connected]
output=10
activation=leaky

[connected]
output=20
activation=leaky

[connected]
output=3
activation=leaky

[softmax]
groups=1
